src/cfe/КСП/Catalogs/crm_Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>crm_Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМагазинаCRM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстатки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТипыЦен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Налогообложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКаталог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТиповоеСоглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Склады</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодCRM</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Каталог</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КаталогПоВидам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/КСП/Catalogs/crm_Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПутьКФайлуКаталогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);

	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ПутьКФайлуКаталога = ДиалогОткрытияФайла.Каталог + "\icml.xml";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ВыгружатьКаталог = Истина Тогда 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Истина; 
		Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИерархияНоменклатуры") = "Виды номенклатуры" Тогда
			ЭтаФорма.Элементы.Каталог.Видимость = Ложь;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Истина;
		Иначе 
			ЭтаФорма.Элементы.Каталог.Видимость = Истина;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Ложь;
		КонецЕсли;
		
		//ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Ложь;
	КонецЕсли;
	
	ИспользоватьСоглашения = ПроверкаОпцииСоглашений();
	Если ИспользоватьСоглашения Тогда 
		ЭтаФорма.Элементы.ТиповоеСоглашение.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ТиповоеСоглашение.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгружатьКаталогПриИзменении(Элемент)
	
	Если Объект.ВыгружатьКаталог = Истина Тогда 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Истина;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
		Если crm_RetailCRMПовтИсп.ПолучитьЗначениеКонстанты("ИерархияНоменклатуры") = "Виды номенклатуры" Тогда
			ЭтаФорма.Элементы.Каталог.Видимость = Ложь;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Истина;
		Иначе 
			ЭтаФорма.Элементы.Каталог.Видимость = Истина;
			ЭтаФорма.Элементы.КаталогПоВидам.Видимость = Ложь;
		КонецЕсли;
		//ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Истина;
	Иначе 
		ЭтаФорма.Элементы.ПутьКФайлуКаталога.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаКаталог.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверкаОпцииСоглашений ()
	ИспользоватьСоглашения = ПолучитьФункциональнуюОпцию("ИспользоватьСоглашенияСКлиентами");
	Возврат ИспользоватьСоглашения;
КонецФункции
